---
kind: type
id: T:Autodesk.Revit.DB.OpenConflictScenario
source: html/7db711fa-cfb1-39da-a184-5aaf4230b660.htm
---
# Autodesk.Revit.DB.OpenConflictScenario

The kinds of conflicts happened during open.

## Syntax (C#)
```csharp
public enum OpenConflictScenario
```